Repository: Godrigos/mediadb
Catalog: lib/l10n/app_*.arb
Languages: pt

# appTitle
source: Culture Media
pt: Meios de Cultura

source: Close
pt: Fechar

source: Ingredients
pt: Ingredientes

source: Preparation
pt: Preparo

# complementList
source: Complements
pt: Complementos

source: P.S.
pt: Observação

source: Reference
pt: Referência

# complement
source: Complementary solution to a medium.
pt: Solução complementar para meio.

# complementGrid
source: Complementary Solution
pt: Solução Complementar

# liquid
source: Liquid medium.
pt: Meio líquido.

# semisolid
source: Semisolid medium.
pt: Meio semi-sólido.

# solid
source: Solid medium.
pt: Meio sólido.

# undefined
source: Undefined medium physical state. A logical entry, should not appear in media list.
pt: Estado do meio indefinido. Uma entrada lógica, não deve aparecer na lista de meios.

# help
source: About
pt: Sobre

# helpIcons
source: Media Icons
pt: Ícones dos Meios

# nothing
source: No recipe available
pt: Nenhuma receita disponível

# favorite
source: Favorites
pt: Favoritos

source: All Media
pt: Todos os Meios

# volume
source: Desired volume
pt: Volume desejado

source: Calculate
pt: Calcular

source: Exit
pt: Sair

source: Copy
pt: Copiar

# updatedVolume
source: Ingredients amounts updated
pt: Quantidades dos ingredientes atualizada

# validNumber
source: Enter a valid number
pt: Entre um número válido

# zero
source: Enter a value higher than zero
pt: Entre um valor maior que zero

source: Error
pt: Erro

# errormsg
source: This medium is missing some details.
pt: Faltam alguns detalhes para esse meio.

# use
source: Common Use
pt: Uso Comum

# aboutApp
source: About Culture Media DB
pt: Sobre o Culture Media DB

# aboutDetails
source: Culture Media DB brings a series of culture media recipes commonly used in microbiology experiments. It shows the ingredients and preparation details of each medium. The references presented by the application are the source of information used by the developer and don't necessarily the source to be cited in scientific articles or reports. If you have any contribution to make such as bug reports, enhancement sugestions or culture medium requirement. Plese, visit https://github.com/Godrigos/mediadb/issues and fill in the appropiate issue. This application was made using Flutter. Application icons made by Freepik from www.flaticon.com.
pt: Culture Media DB traz uma série de receitas de meios de cultura comuns em experimentos de microbiologia. Ele mostra os ingredientes necessários e o modo de preparo de cada meio. As referências apresentadas no aplicativo indicam a fonte da informação usada pelo desenvolvedor e não necessariamente a fonte a ser citada em relatórios ou artigos cintíficos. Se você tem qualquer contribuição a fazer como relatar um problema, segerir melhorias ou solicitar um meio de cultura. Por favor, visite https://github.com/Godrigos/mediadb/issues e preencha o formulário apropriado. Este aplicativo foi feito usando Flutter. Os ícones do aplicativo foram criados pela Freepik a partir da www.flaticon.com.
